Latent space dimension:50
Activation function:relu
Convolution kernel size:3
Convolution strides:2
Padding:same
Batch size:256
Epochs:256
Optimizer:<class 'tensorflow.python.keras.optimizer_v2.adam.Adam'>
Learning rate:0.001
Loss function: <function binary_crossentropy at 0x7f802dafaee0>
Dataset dir:../pickelled/tunnel/shuffled/pointclouds_batch

Autoencoder network summary:
Encoder convolutional filters:ListWrapper([8, 16, 32, 64])
Encoder dense layers:ListWrapper([256, 128])

Decoder Convolutional filters:ListWrapper([64, 32, 16, 8])
Decoder dense layers:ListWrapper([128, 256, 1024])
Model: "encoder"
________________________________________________________________________________________________________________________
Layer (type)                           Output Shape               Param #       Connected to                            
========================================================================================================================
input_1 (InputLayer)                   [(None, 64, 64, 16, 1)]    0                                                     
________________________________________________________________________________________________________________________
conv3d (Conv3D)                        (None, 32, 32, 8, 8)       224           input_1[0][0]                           
________________________________________________________________________________________________________________________
conv3d_1 (Conv3D)                      (None, 16, 16, 4, 16)      3472          conv3d[0][0]                            
________________________________________________________________________________________________________________________
conv3d_2 (Conv3D)                      (None, 8, 8, 2, 32)        13856         conv3d_1[0][0]                          
________________________________________________________________________________________________________________________
conv3d_3 (Conv3D)                      (None, 4, 4, 1, 64)        55360         conv3d_2[0][0]                          
________________________________________________________________________________________________________________________
flatten (Flatten)                      (None, 1024)               0             conv3d_3[0][0]                          
________________________________________________________________________________________________________________________
dense (Dense)                          (None, 256)                262400        flatten[0][0]                           
________________________________________________________________________________________________________________________
dense_1 (Dense)                        (None, 128)                32896         dense[0][0]                             
________________________________________________________________________________________________________________________
z_mean (Dense)                         (None, 50)                 6450          dense_1[0][0]                           
________________________________________________________________________________________________________________________
z_log_var (Dense)                      (None, 50)                 6450          dense_1[0][0]                           
________________________________________________________________________________________________________________________
sampling (Sampling)                    (None, 50)                 0             z_mean[0][0]                            
                                                                                z_log_var[0][0]                         
========================================================================================================================
Total params: 381,108
Trainable params: 381,108
Non-trainable params: 0
________________________________________________________________________________________________________________________
Model: "decoder"
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
input_2 (InputLayer)                                  [(None, 50)]                                    0                 
________________________________________________________________________________________________________________________
dense_2 (Dense)                                       (None, 128)                                     6528              
________________________________________________________________________________________________________________________
dense_3 (Dense)                                       (None, 256)                                     33024             
________________________________________________________________________________________________________________________
dense_4 (Dense)                                       (None, 1024)                                    263168            
________________________________________________________________________________________________________________________
reshape (Reshape)                                     (None, 4, 4, 1, 64)                             0                 
________________________________________________________________________________________________________________________
conv3d_transpose (Conv3DTranspose)                    (None, 8, 8, 2, 64)                             110656            
________________________________________________________________________________________________________________________
conv3d_transpose_1 (Conv3DTranspose)                  (None, 16, 16, 4, 32)                           55328             
________________________________________________________________________________________________________________________
conv3d_transpose_2 (Conv3DTranspose)                  (None, 32, 32, 8, 16)                           13840             
________________________________________________________________________________________________________________________
conv3d_transpose_3 (Conv3DTranspose)                  (None, 64, 64, 16, 8)                           3464              
________________________________________________________________________________________________________________________
conv3d_transpose_4 (Conv3DTranspose)                  (None, 64, 64, 16, 1)                           217               
========================================================================================================================
Total params: 486,225
Trainable params: 486,225
Non-trainable params: 0
________________________________________________________________________________________________________________________