Latent space dimension:30
Activation function:relu
Convolution kernel size:3
Convolution strides:2
Padding:same
Batch size:256
Epochs:128
Optimizer:<class 'tensorflow.python.keras.optimizer_v2.adam.Adam'>
Learning rate:0.001
Loss function: <function binary_crossentropy at 0x7f4ab57c4d30>
Dataset dir:../pickelled/tunnel/shuffled/pointclouds_batch

Autoencoder network summary:
Encoder convolutional filters:ListWrapper([8, 16])
Encoder dense layers:ListWrapper([128, 64])

Decoder Convolutional filters:ListWrapper([16, 8])
Decoder dense layers:ListWrapper([64, 128, 2048])
Model: "encoder"
________________________________________________________________________________________________________________________
Layer (type)                           Output Shape               Param #       Connected to                            
========================================================================================================================
input_1 (InputLayer)                   [(None, 64, 64, 16, 1)]    0                                                     
________________________________________________________________________________________________________________________
conv3d (Conv3D)                        (None, 32, 32, 8, 8)       224           input_1[0][0]                           
________________________________________________________________________________________________________________________
conv3d_1 (Conv3D)                      (None, 16, 16, 4, 16)      3472          conv3d[0][0]                            
________________________________________________________________________________________________________________________
max_pooling3d (MaxPooling3D)           (None, 8, 8, 2, 16)        0             conv3d_1[0][0]                          
________________________________________________________________________________________________________________________
flatten (Flatten)                      (None, 2048)               0             max_pooling3d[0][0]                     
________________________________________________________________________________________________________________________
dense (Dense)                          (None, 128)                262272        flatten[0][0]                           
________________________________________________________________________________________________________________________
dense_1 (Dense)                        (None, 64)                 8256          dense[0][0]                             
________________________________________________________________________________________________________________________
z_mean (Dense)                         (None, 30)                 1950          dense_1[0][0]                           
________________________________________________________________________________________________________________________
z_log_var (Dense)                      (None, 30)                 1950          dense_1[0][0]                           
________________________________________________________________________________________________________________________
sampling (Sampling)                    (None, 30)                 0             z_mean[0][0]                            
                                                                                z_log_var[0][0]                         
========================================================================================================================
Total params: 278,124
Trainable params: 278,124
Non-trainable params: 0
________________________________________________________________________________________________________________________
Model: "decoder"
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
input_2 (InputLayer)                                  [(None, 30)]                                    0                 
________________________________________________________________________________________________________________________
dense_2 (Dense)                                       (None, 64)                                      1984              
________________________________________________________________________________________________________________________
dense_3 (Dense)                                       (None, 128)                                     8320              
________________________________________________________________________________________________________________________
dense_4 (Dense)                                       (None, 2048)                                    264192            
________________________________________________________________________________________________________________________
reshape (Reshape)                                     (None, 8, 8, 2, 16)                             0                 
________________________________________________________________________________________________________________________
up_sampling3d (UpSampling3D)                          (None, 16, 16, 4, 16)                           0                 
________________________________________________________________________________________________________________________
conv3d_transpose (Conv3DTranspose)                    (None, 32, 32, 8, 16)                           6928              
________________________________________________________________________________________________________________________
conv3d_transpose_1 (Conv3DTranspose)                  (None, 64, 64, 16, 8)                           3464              
________________________________________________________________________________________________________________________
conv3d_transpose_2 (Conv3DTranspose)                  (None, 64, 64, 16, 1)                           217               
========================================================================================================================
Total params: 285,105
Trainable params: 285,105
Non-trainable params: 0
________________________________________________________________________________________________________________________